// Задание 2.

// Написать функцию, которая принимает на входе любое число (но не больше 1 000),
// определяет, является ли оно простым, и выводит простое число или нет. Если введено 
// больше 1 000, то выводится сообщение, что данные неверны. Обратите внимание на числа 0 и 1.

function checkSimpleNumber(x) {
    let divCounter = 0;
    if (x > 1000 ) {
        console.log('Число ' + x +' больше 1000, опеределение простого числа не выполнено.');
        return -1;
    }
    for (let i=1; i<=Math.sqrt(x); i++){
        if ((x%i === 0) ) {
            if ((++divCounter >= 2)) {
                console.log('Число ' + x +' не является простым');
                return 0;
            }
        }
    }
    if (divCounter == 1 && x !== 1) {
        console.log('Число ' + x +' - простое');
        return 1;
    } 
    if (divCounter < 2 || x === 0 ) {
        console.log('Число ' + x +' не соответсвует условиям простого числа');
        return -1;
    }0

    
}

// проверяем диапазон 0..20
for (let i=0; i <= 20; i++) {
    checkSimpleNumber(i);
}

// проверяем диапазон 990..1001

for (let i=990; i <= 1001; i++) {
   checkSimpleNumber(i);
}